StreetCanyonWithSpecies2D/0.orig/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 100000;

boundaryField
{
    wallTube
    {
        type            zeroGradient;
    }

    outlet
    {
        type            waveTransmissive;
        psi             thermo:psi;
        lInf            1;
        field           p;
        gamma           1.4;
        fieldInf        100000;
        value           $internalField;
    }

    inletPilot
    {
        type            zeroGradient;
    }

    inletAir
    {
        type            zeroGradient;
    }

    wallOutside
    {
        type            zeroGradient;
    }

    inletCH4
    {
        type            zeroGradient;
    }

    frontAndBack_pos
    {
        type            wedge;
    }

    frontAndBack_neg
    {
        type            wedge;
    }
}


// ************************************************************************* //
